# Brewfile - Homebrew dependencies
# Install all with: brew bundle

# Cask applications directory
cask_args appdir: "~/Applications"

# Essentials
brew "zsh"
brew "git"
brew "neovim"

# Search and navigation
brew "fzf"
brew "ripgrep"
brew "fd"
brew "eza"

# Development tools
brew "node"
brew "python"
brew "git-lfs"

# Modern CLI tools
brew "bat"
brew "delta"
brew "tldr"
brew "jq"

# Terminal enhancement
brew "tmux"

# Optional: fonts (if using homebrew cask)
# cask "font-hack-nerd-font"

# macOS Applications (optional)
# cask "iterm2"
# cask "visual-studio-code"
# cask "docker"

