# Brewfile - Homebrew dependencies
# Install all with: brew bundle

# Cask applications directory
cask_args appdir: "/Applications"

# Essentials
brew "zsh"
brew "git"
brew "neovim"

# Search and navigation
brew "fzf"
brew "ripgrep"
brew "fd"
brew "eza"

# Development tools
brew "node"
brew "python"
brew "git-lfs"
brew "gh"

# Modern CLI tools
brew "bat"
brew "delta"
brew "tldr"
brew "jq"

# Terminal enhancement
brew "tmux"

# Optional: fonts (if using homebrew cask)
# cask "font-hack-nerd-font"

# macOS Applications
cask "brave-browser"
cask "cursor"
cask "iterm2"
cask "raycast"
cask "slack"
cask "cleanshot"
cask "spotify"
cask "aqua-voice"
cask "tableplus"